Repository: oandregal/poss-gl
Catalog: tmx/ch03.tmx
Source language: en
Languages: gl

source: The reason versioning everything together in one place is important is so people only have to learn one mechanism for submitting changes. Often a contributor will start out making edits to the web pages or documentation, and move to small code contributions later, for example. When the project uses the same system for all kinds of submissions, people only have to learn the ropes once. Versioning everything together also means that new features can be committed together with their documentation updates, that branching the code will branch the documentation too, etc.
gl: A razón pola que é importante versionar todo nun único sitio é que deste xeito a xente soamente terá que aprender un mecanismo para incorporar mudanzas. Frecuentemente, un colaborador vai comezar por enviar mudanzas ás páxinas web ou á documentación, e comezará máis tarde a facer pequenas contribucións ao código, por exemplo. Cando o proxecto emprega o mesmo sistema para todos os tipos de contribucións, a xente só terá que afacerse a el unha vez. Manter todas as versións xuntas significa tamén que as novas características poden ser incorporadas xunto coa súa documentación, e que distribuír o código por varias ramas vai supor que a documentación tamén se distribúe, etc.

source: Don't keep <firstterm>generated files</firstterm> under version control. They are not truly editable data, since they are produced programmatically from other files. For example, some build systems create <filename>configure</filename> based on the template <filename>configure.in</filename>. To make a change to the <filename>configure</filename>, one would edit <filename>configure.in</filename> and then regenerate; thus, only the template <filename>configure.in</filename> is an "editable file." Just version the templates&mdash;if you version the result files as well, people will inevitably forget to regenerate when they commit a change to a template, and the resulting inconsistencies will cause no end of confusion.
gl: Non manteñas <firstterm>os ficheiros xerados</firstterm> no sistema de control de versións. Non son propiamente datos editables, xa que son xerados automaticamente a partir de outros ficheiros. Por exemplo, algúns sistemas de montaxe (build) crean o ficheiro <filename>configure</filename> a partir do molde <filename>configure.in</filename>. Para facer unha mudanza a <filename>configure</filename>, terías que editar <filename>configure.in</filename> e posteriormente rexenerar o primeiro; así, tan só o molde <filename>configure.in</filename> é un ficheiro "editable". Polo tanto, mantén no control de versións tan só os moldes&mdash;se inclúes os ficheiros resultantes, a xente vai inevitablemente esquecer rexeneralos cando incorporaren unha mudanza a un molde, e a correspondente falta de cohesión non vai causar máis que confusión.

source: For a different opinion on the question of versioning <filename>configure</filename> files, see Alexey Makhotkin's post "<citetitle>configure.in and version control</citetitle>" at <ulink url="http://versioncontrolblog.com/2007/01/08/configurein-and-version-control/"></ulink>.
gl: Mais se quixeres ler unha segunda opinión acerca da cuestión dos ficheiros <filename>configure</filename>,podes revisar o comentario de Alexey Makhotkin "<citetitle>configure.in and version control</citetitle>" en <ulink url="http://versioncontrolblog.com/2007/01/08/configurein-and-version-control/"></ulink>.

source: The rule that all editable data should be kept under version control has one unfortunate exception: the bug tracker. Bug databases hold plenty of editable data, but for technical reasons generally cannot store that data in the main version control system. (Some trackers have primitive versioning features of their own, however, independent of the project's main repository.)
gl: A regra de que todo dato editable debe ser mantido nun sistema de control de versións ten infelizmente unha excepción: o xestor de erros (bug tracker). As bases de datos de erros conteñen multitude de datos editables, mais por cuestións técnicas non se pode, xeralmente, ter eses datos almacenados nun sistema de control de versións. (Algúns xestores de erros incorporan de seu algunhas funcionalidades moi primitivas de control de versións, mais en calquera caso independentes do repositorio principal do proxecto).

source: Browsability
gl: Navegabilidade

source: The project's repository should be browsable on the Web. This means not only the ability to see the latest revisions of the project's files, but to go back in time and look at earlier revisions, view the differences between revisions, read log messages for selected changes, etc.
gl: O repositorio do proxecto debe ser navegable desde a web. Isto inclúe non só a habilidade para ver a última revisión dos ficheiros do proxecto, senón tamén poder ir atrás no tempo e visitar revisións anteriores, ver as diferencias entre elas, ler as mensaxes de seguimento (log) de mudanzas concretas, etc.

source: Browsability is important because it is a lightweight portal to project data. If the repository cannot be viewed through a web browser, then someone wanting to inspect a particular file (say, to see if a certain bugfix had made it into the code) would first have to install version control client software locally, which could turn their simple query from a two-minute task into a half-hour or longer task.
gl: A navegabilidade é importante porque supón o uso dun portal lixeiro de acceso aos datos do proxecto. Se o repositorio non pode ser visitado desde un navegador web, entón alguén que pretenda ver un ficheiro en particular (nomeadamente: comprobar se unha corrección dun erro foi xa incorporada ao código), primeiro tería que instalar localmente un cliente do sistema de control de versións, o que podería tornar a súa tarefa inicial de un par de minutos nun traballo de polo menos media hora.

source: Browsability also implies canonical URLs for viewing specific revisions of files, and for viewing the latest revision at any given time. This can be very useful in technical discussions or when pointing people to documentation. For example, instead of saying "For tips on debugging the server, see the www/hacking.html file in your working copy," one can say "For tips on debugging the server, see <emphasis>http://svn.collab.net/repos/svn/trunk/www/hacking.html</emphasis>," giving a URL that always points to the latest revision of the <filename>hacking.html</filename> file. The URL is better because it is completely unambiguous, and avoids the question of whether the addressee has an up-to-date working copy.
gl: Implica tamén a existencia de URL normalizadas para acceder a revisións específicas dos ficheiros, e para visitar a última revisión nun momento dado. Isto pode ser moi útil cara a discusións técnicas ou cando se trata de dirixir a xente cara á documentación. Por exemplo, en troca de dicir "Para informarse sobre instrucións para reparar o servidor, diríxase ao ficheiro www/hacking.html na súa copia local", podería dicirse"Para informarse sobre instrucións para reparar o servidor, visite <emphasis>http://svn.collab.net/repos/svn/trunk/www/hacking.html</emphasis>," proporcionando unha URL que vai dirixir sempre á última revisión do ficheiro <filename>hacking.html</filename>. A URL é mellor xa que carece totalmente de ambigüidade, e evita o problema de se o destinatario ten unha copia de traballo completamente actualizada.

source: Some version control systems come with built-in repository-browsing mechanisms, while others rely on third-party tools to do it. Three such tools are <firstterm>ViewVC</firstterm> (<ulink url="http://viewvc.org/"></ulink>), <firstterm>CVSWeb</firstterm> (<ulink url="http://www.freebsd.org/projects/cvsweb.html"></ulink>), and <firstterm>WebSVN</firstterm> (<ulink url="http://websvn.tigris.org/"></ulink>). The first works with both CVS and Subversion, the second with CVS only, and the third with Subversion only.
gl: Algúns sistemas de control de versións incorporan mecanismos internos de navegación polo repositorio, mentres que outros empregan ferramentas de terceiros. Estas ferramentas son:<firstterm>ViewVC</firstterm> (<ulink url="http://viewvc.org/"></ulink>), <firstterm>CVSWeb</firstterm> (<ulink url="http://www.freebsd.org/projects/cvsweb.html"></ulink>), e <firstterm>WebSVN</firstterm> (<ulink url="http://websvn.tigris.org/"></ulink>). A primeira traballa sobre CVS e Subversion, a segunda só sobre CVS, e a terceira só sobre Subversion.

source: Commit emails
gl: Mensaxes de incorporación de mudanzas (Commit emails)

source: Every commit to the repository should generate an email showing who made the change, when they made it, what files and directories changed, and how they changed. The email should go to a special mailing list devoted to commit emails, separate from the mailing lists to which humans post. Developers and other interested parties should be encouraged to subscribe to the commits list, as it is the most effective way to keep up with what's happening in the project at the code level. Aside from the obvious technical benefits of peer review (see <xref linkend="code-review"/>), commit emails help create a sense of community, because they establish a shared environment in which people can react to events (commits) that they know are visible to others as well.
gl: Toda incorporación de mudanzas ao repositorio (commit) debería xerar unha mensaxe na que conste quen fixo a mudanza, cando a fixo, que ficheiros e directorios mudou, e en que consistiron as mudanzas. A mensaxe debería ser enviada a unha lista de correo específica, distinta das empregadas para xestionar as mensaxes dos colaboradores. Deberíase recomendar aos desenvolvedores e outras persoas interesadas que se desen de alta na lista de mensaxes de mudanzas, xa que este é o modo máis efectivo de manter o coñecemento sobre que é o que se está a facer no proxecto a respecto do código. Para alén das evidentes vantaxes técnicas da revisión entre iguais (véxase <xref linkend="revisión-do-código"/>), as mensaxes de incorporación de mudanzas axudan a crear un espírito de comunidade, xa que dotan ao proxecto dun entorno común onde a xente pode reaccionar ante os eventos (incorporación de mudanzas) que saben que están visibles tamén para os demais.

source: The specifics of setting up commit emails will vary depending on your version control system, but usually there's a script or other packaged facility for doing it. If you're having trouble finding it, try looking for documentation on <firstterm>hooks</firstterm>, specifically a <firstterm>post-commit hook</firstterm>, also called the <firstterm>loginfo hook</firstterm> in CVS. Post-commit hooks are a general means of launching automated tasks in response to commits. The hook is triggered by an individual commit, is fed all the information about that commit, and is then free to use that information to do anything&mdash;for example, to send out an email.
gl: As cuestións específicas sobre a configuración de mensaxes de incorporación de mudanzas varían dependendo de cal sexa o teu sistema de control de versións, mais xeralmente hai un script ou outra clase de utilidade para facelo. Se tiveres problemas para atopala, tenta buscar na documentación por <firstterm>hooks</firstterm>, e especialmente <firstterm>post-commit hook</firstterm>, tamén chamado <firstterm>loginfo hook</firstterm> en CVS. Os "post-commit hooks" constitúen un modo xeral de lanzar tarefas automatizadas en resposta á incorporación de mudanzas. O "hook" dispárase ante a incorporación dunha mudanza en concreto, aliméntase da información acerca desa mudanza e é logo libre de usar esa información para realizar calquera outra operación&mdash; por exemplo, enviar un correo electrónico.

source: With pre-packaged commit email systems, you may want to modify some of the default behaviors:
gl: No caso dos sistemas de envío de mensaxes de actualización pre-empacotados, talvez queiras modificar algúns dos comportamentos por defecto:

source: Some commit mailers don't include the actual diffs in the email, but instead provide a URL to view the change on the web using the repository browsing system. While it's good to provide the URL, so the change can be referred to later, it is also <emphasis>very</emphasis> important that the commit email include the diffs themselves. Reading email is already part of people's routine, so if the content of the change is visible right there in the commit email, developers will review the commit on the spot, without leaving their mail reader. If they have to click on a URL to review the change, most won't do it, because that requires a new action instead of a continuation of what they were already doing. Furthermore, if the reviewer wants to ask something about the change, it's vastly easier to hit reply-with-text and simply annotate the quoted diff than it is to visit a web page and laboriously cut-and-paste parts of the diff from web browser to email client.
gl: Algúns destes sistemas non inclúen os "diff" no email, mais inclúen unha URL na que consultar as mudanzas no repositorio a través do navegador web. Aínda que achegar a URL está ben, de xeito que se pode facer referencia á mudanza máis tarde, é tamén <emphasis>moi</emphasis> importante que a mensaxe de envío da mudanza inclúa os propios diff. A lectura dos emails é parte da rutina da xente, así que se o contido das mudanzas é visible xusto no mesmo email de mudanzas, os desenvolvedores revisarán a mudanza sobre a marcha, sen abandonar o seu lector de emails. Se teñen que premer unha ligazón para poder revisalo, os máis non o farán, xa que isto require unha nova acción en troca da continuación do que xa estaban a facer. Aínda máis, se o revisor quere preguntar algo sobre a mudanza feita, é considerablemente máis sinxelo responder á mensaxe e incluír os comentarios sobre o rexistro de diferencias directamente sobre o propio texto do que é visitar a páxina web e cortar e colar partes do rexistro no cliente de email.

source: (Of course, if the diff is huge, such as when a large body of new code has been added to the repository, then it makes sense to omit the diff and offer only the URL. Most commit mailers can do this kind of limiting automatically. If yours can't, then it's still better to include diffs, and live with the occasional huge email, than to leave the diffs off entirely. Convenient reviewing and commenting is a cornerstone of cooperative development, much too important to do without.)
gl: (Desde logo, se o reporte de diferencias é moi grande, como no caso de que se teña engadido ao repositorio un corpo de texto completamente novo, terá sentido omitir a información do "diff" e achegar tan só a URL. Os máis dos programas de envío de correos de actualización poden facer este tipo de discriminación automática. Se o teu non pode, o mellor será manter a inclusión dos "diff" e resignarse a sufrir mensaxes ocasionalmente enormes, que eliminalos por completo. A facilidade para facer revisións e comentarios é de vital importancia para o desenvolvemento colaborativo, demasiado para deixalos de lado)

source: The commit emails should set their Reply-to header to the regular development list, not the commit email list. That is, when someone reviews a commit and writes a response, their response should be automatically directed toward the human development list, where technical issues are normally discussed. There are a few reasons for this. First, you want to keep all technical discussion on one list, because that's where people expect it to happen, and because that way there's only one archive to search. Second, there might be interested parties not subscribed to the commit email list. Third, the commit email list advertises itself as a service for watching commits, not for watching commits <emphasis>and</emphasis> occasional technical discussions. Those who subscribed to the commit email list did not sign up for anything but commit emails; sending them other material via that list would violate an implicit contract. Fourth, people often write programs that read the commit email list and process the results (for display on a web page, for example). Those programs are prepared to handle consistently-formatted commit emails, but not inconsistent human-written mails.
gl: Os correos de subida de mudanzas deberían ter o cabezallo "Reply-to" dirixido á lista normal de desenvolvemento, non á de mudanzas. É dicir, cando alguén revisa unha mudanza e remite un comentario á mesma, a súa resposta debería ser automaticamente encamiñada á lista dos desenvolvedores humanos, na que normalmente se discuten os asuntos técnicos. Hai unhas cantas razóns para facelo así. Primeiro, todas as discusións técnicas deben facerse nunha única lista xa que iso é o que a xente espera que ocorra, e porque dese xeito hai un só arquivo no que facer pesquisas. En segundo lugar, talvez haxa colaboradores que non estean subscritos á lista de mudanzas. Terceiro, a lista de correo de mudanzas se autopublicita como un servizo para facer seguimento das mudanzas, non para facer seguimento das mudanzas <emphasis>e</emphasis> de discusións técnicas ocasionais. Cando un se subscribe á lista de correo de mudanzas, non se está subscribindo ademais a ningunha outra lista; enviarlles outros materiais a través da lista violaría un contrato implícito. En cuarto lugar, a xente escribe frecuentemente pequenos programas que len a lista de mudanzas e procesan os resultados (de cara á súa publicación nunha páxina web, por exemplo). Eses programas están preparados para manipular mensaxes de correo-e formatadas de forma consistente, mais non mensaxes incoherentes escritas por humanos.

source: Note that this advice to set Reply-to does not contradict the recommendations in <xref linkend="reply-to"/><phrase output="printed"> earlier in this chapter</phrase>. It's always okay for the <emphasis>sender</emphasis> of a message to set Reply-to. In this case, the sender is the version control system itself, and it sets Reply-to in order to indicate that the appropriate place for replies is the development mailing list, not the commit list.
gl: Ten en conta que esta recomendación acerca da configuración do cabezallo "Reply-to" non refuta o comentado anteriormente neste capítulo acerca do <xref linkend="reply-to"/><phrase output="printed"> </phrase>. Normalmente o <emphasis>remitente</emphasis> dunha mensaxe vai considerar correcto establecer o "Reply-to". Neste caso, o remitente é o propio sistema de control de versións, e configura o "Reply-to" para indicar que o lugar apropiado para responder ás súas mensaxes é a lista de desenvolvemento, non a de mudanzas.

source: CIA: Another Change Publication Mechanism
gl: CIA: outro mecanismo de publicación de mudanzas (Another Change Publication Mechanism)

source: Commit emails are not the only way to propagate change news. Recently, another mechanism called CIA (<ulink url="http://cia.navi.cx/"></ulink>) has been developed. CIA is a real-time commit statistics aggregator and distributor. The most popular use of CIA is to send commit notifications to IRC channels, so that people logged into those channels see the commits happening in real time. Though of somewhat less technical utility than commit emails, since observers might or might not be around when a commit notice pops up in IRC, this technique is of immense <emphasis>social</emphasis> utility. People get the sense of being part of something alive and active, and feel that they can see progress being made right before their eyes.
gl: As mensaxes de mudanzas non son a única maneira de propagar as novas sobre as mudanzas feitas. Recentemente desenvolveuse un novo mecanismo denominado CIA (<ulink url="http://cia.navi.cx/"></ulink>). CIA é un agregador e distribuidor en tempo real de estatísticas sobre mudanzas. O uso máis popular de CIA é o de enviar notificacións de agregación de mudanzas a canais IRC, de xeito que a xente que está conectada a eses canais pode ver a incorporación das mudanzas en tempo real. Aínda que menos útil tecnicamente que as mensaxes de mudanzas, xa que os observadores poden estar conectados ao canal ou non cando aparece no IRC unha nova sobre unha mudanza, esta técnica ten unha inmensa utilidade <emphasis>social</emphasis>. A xente terá a sensación de formar parte de algo vivo e activo, e sentirá que se progresa xusto ante os seus ollos.

source: The way it works is that you invoke the CIA notifier program from your post-commit hook. The notifier formats the commit information into an XML message, and sends to a central server (typically <literal>cia.navi.cx</literal>). That server then distributes the commit information to other forums.
gl: A maneira en que traballa consiste en que ti invocas o programa CIA de notificación desde o gancho (hook) do teu sistema de publicación de mudanzas. O notificador formata a XML a información da mudanza, e a envía como mensaxe a un servidor central (típicamente cia.navi.cx</literal>). A continuación, ese servidor distribúe a información sobre a mudanza a outros foros.

source: CIA can also be configured to send out <ulink url="http://www.xml.com/pub/a/2002/12/18/dive-into-xml.html">RSS</ulink> feeds. See the documentation at <ulink url="http://cia.navi.cx/"></ulink> for details.
gl: CIA pode ser configurado tamén para enviar comunicacións <ulink url="http://www.xml.com/pub/a/2002/12/18/dive-into-xml.html">RSS</ulink>. Podes consultar os detalles na documentación do proxecto en <ulink url="http://cia.navi.cx/"></ulink>.

source: To see an example of CIA in action, point your IRC client at <literal>irc.freenode.net</literal>, channel <literal>#commits</literal>.
gl: Para ver un exemplo de CIA en acción, accede desde o teu cliente IRC a <literal>irc.freenode.net</literal>, channel <literal>#commits</literal>.

source: Use branches to avoid bottlenecks
gl: Usa as ramas para evitar gargalos

source: Non-expert version control users are sometimes a bit afraid of branching and merging. This is probably a side effect of CVS's popularity: CVS's interface for branching and merging is somewhat counterintuitive, so many people have learned to avoid those operations entirely.
gl: Os usuarios non expertos dos sistemas de control de versións ás veces lle teñen un certo medo á creación de ramas (branching)e á posterior fusión (merging). Trátase probablemente dun efecto colateral da popularidade dos CVS: a súa interface de creación de ramas e fusión é pouco intuitiva, de xeito que moita xente aprendeu a evitar esas operacións por completo.

source: If you are among those people, resolve right now to conquer any fears you may have and take the time to learn how to do branching and merging. They are not difficult operations, once you get used to them, and they become increasingly important as a project acquires more developers.
gl: Si ti es unha destas persoas, toma a decisión xa mesmo de superares eses medos e toma o tempo preciso para aprenderes como facer a creación de ramas e a fusión. Non son operacións difíciles, unha vez que estás afeito a elas, e convértense en máis e máis importantes segundo o proxecto vai incorporando máis desenvolvedores.
